ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_SHA_CE004000h.xml
<module name="HSM_SHA" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="HSM_SHA_S_ODIGEST_A" acronym="HSM_SHA_S_ODIGEST_A" offset="0" width="32" description=" WRITE: Outer Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / HMAC Key [31:0] for HMAC key proc READ: Outer Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_B" acronym="HSM_SHA_S_ODIGEST_B" offset="4" width="32" description=" WRITE: Outer Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / HMAC Key [63:32] for HMAC key proc READ: Outer Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_C" acronym="HSM_SHA_S_ODIGEST_C" offset="8" width="32" description=" WRITE: Outer Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2 / HMAC Key [95:64] for HMAC key proc READ: Outer Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_D" acronym="HSM_SHA_S_ODIGEST_D" offset="12" width="32" description=" WRITE: Outer Digest [31:0] for MD5 [63:31] for SHA-1 [159:128] for SHA-2 / HMAC Key [127:96] for HMAC key proc READ: Outer Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_E" acronym="HSM_SHA_S_ODIGEST_E" offset="16" width="32" description=" WRITE: Outer Digest [31:0] for SHA-1 [127:96] for SHA-2 / HMAC Key [159:128] for HMAC key proc READ: Outer Digest [31:0] for SHA-1 [127:96] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_F" acronym="HSM_SHA_S_ODIGEST_F" offset="20" width="32" description=" WRITE: Outer Digest [95:64] for SHA-2 / HMAC Key [191:160] for HMAC key proc READ: Outer Digest [95:64] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_G" acronym="HSM_SHA_S_ODIGEST_G" offset="24" width="32" description=" WRITE: Outer Digest [63:32] for SHA-2 / HMAC Key [223:192] for HMAC key proc READ: Outer Digest [63:32] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_ODIGEST_H" acronym="HSM_SHA_S_ODIGEST_H" offset="28" width="32" description=" WRITE: Outer Digest [31:0] for SHA-2 / HMAC Key [255:224] for HMAC key proc READ: Outer Digest [31:0] for SHA-2">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_A" acronym="HSM_SHA_S_IDIGEST_A" offset="32" width="32" description=" WRITE: Inner / Initial Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / HMAC Key [287:256] for HMAC key proc READ: Intermediate / Inner Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / Result Digest/MAC [127:96] for MD5 [159:128] for SHA-1 [223:192] for SHA-2 224 [255:224] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_B" acronym="HSM_SHA_S_IDIGEST_B" offset="36" width="32" description=" WRITE: Inner / Initial Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / HMAC Key [319:288] for HMAC key proc READ: Intermediate / Inner Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / Result Digest/MAC [95:64] for MD5 [127:96] for SHA-1 [191:160] for SHA-2 224 [223:192] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_C" acronym="HSM_SHA_S_IDIGEST_C" offset="40" width="32" description=" WRITE: Inner / Initial Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA- 2 / HMAC Key [351:320] for HMAC key proc READ: Intermediate / Inner Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2 / Result Digest/MAC [63:32] for MD5 [95:64] for SHA-1 [159:128] for SHA-2 224 [191:160] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_D" acronym="HSM_SHA_S_IDIGEST_D" offset="44" width="32" description=" WRITE: Inner / Initial Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2 / HMAC Key [383:352] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2 / Result Digest/MAC [31:0] for MD5 [63:32] for SHA-1 [127:96] for SHA-2 224 [159:128] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_E" acronym="HSM_SHA_S_IDIGEST_E" offset="48" width="32" description=" WRITE: Inner / Initial Digest [31:0] for SHA-1 [127:96] for SHA-2 / HMAC Key [415:384] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for SHA-1 [127:96] for SHA-2 / Result Digest/MAC [31:0] for SHA-1 [95:64] for SHA-2 224 [127:96] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_F" acronym="HSM_SHA_S_IDIGEST_F" offset="52" width="32" description=" WRITE: Inner / Initial Digest [95:64] for SHA-2 / HMAC Key [447:416] for HMAC key proc READ: Intermediate / Inner Digest [95:64] for SHA-2 / Result Digest/MAC [63:32] for SHA-2 224 [95:64] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_G" acronym="HSM_SHA_S_IDIGEST_G" offset="56" width="32" description=" WRITE: Inner / Initial Digest [63:32] for SHA-2 / HMAC Key [479:448] for HMAC key proc READ: Intermediate / Inner Digest [63:32] for SHA-2 / Result Digest/MAC [31:0] for SHA-2 224 [63:32] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IDIGEST_H" acronym="HSM_SHA_S_IDIGEST_H" offset="60" width="32" description=" WRITE: Inner / Initial Digest [31:0] for SHA-2 / HMAC Key [511:480] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for SHA-2 / Result Digest/MAC [31:0] for SHA-2 256.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_DIGEST_COUNT" acronym="HSM_SHA_S_DIGEST_COUNT" offset="64" width="32" description=" WRITE: Initial Digest Count ([31:6] only [5:0] assumed 0) READ: Result / IntermediateDigest Count The initial digest byte count for hash/HMAC continue operations (HMAC Key Processing = 0 and Use Algorithm Constants = 0) on the Secure World must be written to this register prior to starting the operation by writing to S_HASH_MODE. When either HMAC Key Processing is 1 or Use Algorithm Constants is 1 this register does not need to be written it will be overwritten with 64 (1 hash block of key XOR ipad) or 0 respectively automatically. When starting a HMAC operation from pre-computes (HMAC Key Processing is 0) then the value 64 must be written here to compensate for the appended key XOR ipad block. Note that the value written should always be a 64 byte multiple the lower 6 bits written are ignored.  The updated digest byte count (initial digest byte count + bytes processed) can be read from this register when the status register indicates that the operation is done or suspended due to a context switch request or when a Secure World context out DMA is requested. In Advanced DMA mode when not suspended with a partial result reading the SHA_P_DIGEST_COUNT register triggers the Hash/HMAC Engine to start the next context input DMA. Therefore reading the SHA_P_DIGEST_COUNT register should always be the last context-read action if not suspended with a partial result (i.e. PartHashReady interrupt not pending).">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_MODE" acronym="HSM_SHA_S_MODE" offset="68" width="32" description=" Register SHA_MODE.">
		<bitfield id="HMAC_OUTER_HASH" width="1" begin="7" end="7" resetval="0x0" description="The HMAC Outer Hash is performed on the hash digest when the inner hash hash finished [block length exhausted and final hash performed if close_hash is 1]. This bit should normally be set together with close_hash to finish the inner hash first or Block Length should be zero [HMAC continue with the just outer hash to be done]. Auto cleared internally when outer hash performed. 0 No operation 1 hmac processing" range="7" rwaccess="R/W"/>
	<bitfield id="HMAC_KEY_PROC" width="1" begin="5" end="5" resetval="0x0" description="Performs HMAC key processing on the 512 bit HMAC key loaded into the SHA_P_IDIGEST_{A to H} and SHA_P_ODIGEST_{A to H} register block. Once HMAC key processing is finished this bit is automatically cleared and the resulting Inner and Outer digest is available from SHA_P_IDIGEST_{A to H} and SHA_P_ODIGEST_{A to H} respectively after which regular hash processing [using SHA_P_IDIGEST_{A to H} as initial digest] will commence until the Block Length is exhausted. 0 No operation. 1 Hmac processing." range="5" rwaccess="R/W"/>
	<bitfield id="CLOSE_HASH" width="1" begin="4" end="4" resetval="0x0" description="Performs the padding the hash/HMAC will be 'closed' at the end of the block as per MD5/SHA-1/SHA-2 specification [i.e. appropriate padding is added] or no padding is done allowing the hash to be continued later. However if the hash/HMAC is not closed then the Block Length MUST be a multiple of 64 bytes to ensure correct operation. Auto cleared internally when hash closed. 0 No padding hash computation can be contimued. 1 Last packet will be padded." range="4" rwaccess="R/W"/>
	<bitfield id="ALGO_CONSTANT" width="1" begin="3" end="3" resetval="0x0" description="The initial digest register will be overwritten with the algorithm constants for the selected algorithm when hashing and the initial digest count register will be reset to 0. This will start a normal hash operation. When continuing an existing hash or when performing an HMAC operation this register must be set to 0 and the intermediate/inner digest or HMAC key and digest count need to be written to the context input registers prior to Writing SHA_P_MODE. Auto cleared internally after first block processed. 0 Use pre-calculated digest [from an other operation] 1 Use constants of the selected algo." range="3" rwaccess="R/W"/>
	<bitfield id="ALGO" width="2" begin="2" end="1" resetval="0x0" description="These bits select the hash algorithm to be used for processing: 0 md5_128 algorithm 0x1 sha1_160 algorithm 0x2 sha2_224 algorithm 0x3 sha2_256 algorithm" range="2:1" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_LENGTH" acronym="HSM_SHA_S_LENGTH" offset="72" width="32" description=" WRITE: Block Length / Remaining Byte Count (bytes) READ: Remaining Byte Count. The value programmed MUST be a 64-byte multiple if Close Hash is set to 0. This register is also the trigger to start processing: once this register is written the core will commence requesting input data via DMA or IRQ (if programmed length > 0) and start processing. The remaining byte count for the active operation can be read from this register when the interrupt status register indicates that the operation is suspended due to a context switch request.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_DATA0_IN" acronym="HSM_SHA_S_DATA0_IN" offset="128" width="32" description=" Data input message 0">
		<bitfield id="DATA0_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA1_IN" acronym="HSM_SHA_S_DATA1_IN" offset="132" width="32" description=" Data input message 1">
		<bitfield id="DATA1_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA2_IN" acronym="HSM_SHA_S_DATA2_IN" offset="136" width="32" description=" Data input message 2">
		<bitfield id="DATA2_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA3_IN" acronym="HSM_SHA_S_DATA3_IN" offset="140" width="32" description=" Data input message 3">
		<bitfield id="DATA3_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA4_IN" acronym="HSM_SHA_S_DATA4_IN" offset="144" width="32" description=" Data input message 4">
		<bitfield id="DATA4_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA5_IN" acronym="HSM_SHA_S_DATA5_IN" offset="148" width="32" description=" Data input message 5">
		<bitfield id="DATA5_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA6_IN" acronym="HSM_SHA_S_DATA6_IN" offset="152" width="32" description=" Data input message 6">
		<bitfield id="DATA6_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA7_IN" acronym="HSM_SHA_S_DATA7_IN" offset="156" width="32" description=" Data input message 7">
		<bitfield id="DATA7_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA8_IN" acronym="HSM_SHA_S_DATA8_IN" offset="160" width="32" description=" Data input message 8">
		<bitfield id="DATA8_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA9_IN" acronym="HSM_SHA_S_DATA9_IN" offset="164" width="32" description=" Data input message 9">
		<bitfield id="DATA9_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA10_IN" acronym="HSM_SHA_S_DATA10_IN" offset="168" width="32" description=" Data input message 10.">
		<bitfield id="DATA10_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA11_IN" acronym="HSM_SHA_S_DATA11_IN" offset="172" width="32" description=" Data input message 11.">
		<bitfield id="DATA11_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA12_IN" acronym="HSM_SHA_S_DATA12_IN" offset="176" width="32" description=" Data input message 12.">
		<bitfield id="DATA12_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA13_IN" acronym="HSM_SHA_S_DATA13_IN" offset="180" width="32" description=" Data input message 13.">
		<bitfield id="DATA13_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA14_IN" acronym="HSM_SHA_S_DATA14_IN" offset="184" width="32" description=" Data input message 14.">
		<bitfield id="DATA14_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_DATA15_IN" acronym="HSM_SHA_S_DATA15_IN" offset="188" width="32" description=" Data input message 15.">
		<bitfield id="DATA15_IN" width="32" begin="31" end="0" resetval="0x0" description="data" range="31:0" rwaccess="W"/>
	</register><register id="HSM_SHA_S_REVISION" acronym="HSM_SHA_S_REVISION" offset="256" width="32" description=" Register SHA_REV.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish between old scheme and current. Read 0 Legacy ASP or WTBU scheme Read 0x1 Highlander 0.8 scheme" range="31:30" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x12" description="Function indicates a software compatible module family. If there is no level of software compatibility a new Func number [and hence REVISION] should be assigned." range="27:16" rwaccess="R"/>
	<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x1" description="RTL Version [R] maintained by IP design owner. RTL follows a numbering such as X.Y.R.Z which are explained in this table. R changes ONLY when: [1] PDS uploads occur which may have been due to spec changes [2] Bug fixes occur [3] Resets to '0' when X or Y changes. Design team has an internal 'Z' [customer invisible] number which increments on every drop that happens due to DV and RTL updates. Z resets to 0 when R increments." range="15:11" rwaccess="R"/>
	<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major Revision [X] maintained by IP specification owner. X changes ONLY when: [1] There is a major feature addition. An example would be adding Master Mode to Utopia Level2. The Func field [or Class/Type in old PID format] will remain the same. X does NOT change due to: [1] Bug fixes [2] Change in feature parameters." range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version for a particular device. Consequence of use may avoid use of standard Chip Support Library [CSL] / Drivers. Read 0 Non custom [standard] revision" range="7:6" rwaccess="R"/>
	<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor Revision [Y] maintained by IP specification owner. Y changes ONLY when: [1] Features are scaled [up or down]. Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available. [2] When feature creeps from Is-Not list to Is list. But this may not be the case once it sees silicon; in which case X will change. Y does NOT change due to: [1] Bug fixes [2] Typos or clarifications [3] major functional/feature change/addition/deletion. Instead these changes may be reflected via R S X as applicable. Spec owner maintains a customer-invisible number 'S' which changes due to: [1] Typos/clarifications [2] Bug documentation. Note that this bug is not due to a spec change but due to implementation. Nevertheless the spec tracks the IP bugs. An RTL release [say for silicon PG1.1] that occurs due to bug fix should document the corresponding spec number [X.Y.S] in its release notes." range="5:0" rwaccess="R"/>
	</register><register id="HSM_SHA_S_SYSCONFIG" acronym="HSM_SHA_S_SYSCONFIG" offset="272" width="32" description=" Register SHA_SYSCONFIG.">
		<bitfield id="PADVANCED" width="1" begin="7" end="7" resetval="0x0" description="If set to 1 Advanced mode is enabled for the Secure World. If set to 0 Legacy mode is enabled for the Secure World." range="7" rwaccess="R/W"/>
	<bitfield id="PCONT_SWT" width="1" begin="6" end="6" resetval="0x0" description="Finish all pending data and context DMA input requests [but will not assert any new requests] finish processing all data in the module and provide a saved context [partial hash result updated digest count remaining length updated mode information where applicable] for the last operation that was interrupted so that it can be resumed later." range="6" rwaccess="R/W"/>
	<bitfield id="PDMA_EN" width="1" begin="3" end="3" resetval="0x0" description="Enable dma Read 0 Interrupt disenabled Read 1 Interrupt enabled" range="3" rwaccess="R/W"/>
	<bitfield id="PIT_EN" width="1" begin="2" end="2" resetval="0x0" description="Enable interrupt Read 0 Interrupt disenabled Read 1 Interrupt enabled" range="2" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_SYSSTATUS" acronym="HSM_SHA_S_SYSSTATUS" offset="276" width="32" description=" Register SHA_SYSSTATUS.">
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="data" range="0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_IRQSTATUS" acronym="HSM_SHA_S_IRQSTATUS" offset="280" width="32" description=" Register SHA_IRQSTATUS.">
		<bitfield id="CONTEXT_READY" width="1" begin="3" end="3" resetval="0x1" description="Indicates that the secure side context input registers are available for a new context for the next packet to be processed." range="3" rwaccess="R"/>
	<bitfield id="PARTHASH_READY" width="1" begin="2" end="2" resetval="0x0" description="After a secure side context switch request this bit will read as 1 indicating that the saved context is available from the secure side context output registers. Note that if the context switch request coincides with a final hash [when hashing] or an outer hash [when doing HMAC] that PartHashReady will not become active but a regular Output Ready will occur instead [indicating that the result is final and therefore no continuation is required]." range="2" rwaccess="R"/>
	<bitfield id="INPUT_READY" width="1" begin="1" end="1" resetval="0x0" description="Indicates that the secure side data FIFO is ready to receive the next 64 byte data block." range="1" rwaccess="R"/>
	<bitfield id="OUTPUT_READY" width="1" begin="0" end="0" resetval="0x0" description="Indicates that a [partial] result or saved context is available from the secure side context output registers." range="0" rwaccess="R"/>
	</register><register id="HSM_SHA_S_IRQENABLE" acronym="HSM_SHA_S_IRQENABLE" offset="284" width="32" description=" Register SHA_IRQENABLE. The SHA_P_IRQENABLE register contains an enable bit for each unique interrupt for the public side. An interrupt is enabled when both the global enable in SHA_P_SYSCONFIG (PIT_en) and the bit in this register are both set to 1. An interrupt that is enabled is propagated to the SINTREQUEST_P output. Please note that the dedicated partial hash output (SINTREQUEST_PART_P) is not affected by this register it is only affected by the global enable SHA_P_SYSCONFIG (PIT_en).">
		<bitfield id="M_CONTEXT_READY" width="1" begin="3" end="3" resetval="0x0" description="mask for context ready" range="3" rwaccess="R/W"/>
	<bitfield id="M_PARTHASH_READY" width="1" begin="2" end="2" resetval="0x1" description="mask for partial hash" range="2" rwaccess="R/W"/>
	<bitfield id="M_INPUT_READY" width="1" begin="1" end="1" resetval="0x1" description="mask for input_ready" range="1" rwaccess="R/W"/>
	<bitfield id="M_OUTPUT_READY" width="1" begin="0" end="0" resetval="0x1" description="mask for output_ready" range="0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_S_XSSTATUS" acronym="HSM_SHA_S_XSSTATUS" offset="320" width="32" description="Secure/Private world Register read/write status.">
		<bitfield id="PDIRTY" width="1" begin="3" end="3" resetval="0x0" description="This bit is set to 1 by the module if any of the Public World registers is written. It can be cleared by the host by Writing a 1 in this location." range="3" rwaccess="R/W"/>
