ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_SHA_CE004000h.xml
		<bitfield id="ODIGEST_A" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [511:480] for SHA-384 and SHA-512 / SHA512_HMAC Key [31:0] for HMAC key procR: Outer Digest [511:480] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_B" acronym="HSM_SHA_P_HASH512_ODIGEST_B" offset="4612" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_B" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [479:448] for SHA-384 and SHA-512 / SHA512_HMAC Key [63:32] for HMAC key procR: Outer Digest [479:448] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_C" acronym="HSM_SHA_P_HASH512_ODIGEST_C" offset="4616" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_C" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [447:416] for SHA-384 and SHA-512 / SHA512_HMAC Key [95:64] for HMAC key procR: Outer Digest [447:416] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_D" acronym="HSM_SHA_P_HASH512_ODIGEST_D" offset="4620" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_D" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [415:384] for SHA-384 and SHA-512 / SHA512_HMAC Key [127:96] for HMAC key procR: Outer Digest [415:384] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_E" acronym="HSM_SHA_P_HASH512_ODIGEST_E" offset="4624" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_E" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [383:352] for SHA-384 and SHA-512 / SHA512_HMAC Key [159:128] for HMAC key procR: Outer Digest [383:352] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_F" acronym="HSM_SHA_P_HASH512_ODIGEST_F" offset="4628" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_F" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [351:320] for SHA-384 and SHA-512 / SHA512_HMAC Key [191:160] for HMAC key procR: Outer Digest [351:320] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_G" acronym="HSM_SHA_P_HASH512_ODIGEST_G" offset="4632" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_G" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [319:288] for SHA-384 and SHA-512 / SHA512_HMAC Key [223:192] for HMAC key procR: Outer Digest [319:288] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_H" acronym="HSM_SHA_P_HASH512_ODIGEST_H" offset="4636" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_H" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [287:256] for SHA-384 and SHA-512 / SHA512_HMAC Key [255:244] for HMAC key procR: Outer Digest [287:256] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_I" acronym="HSM_SHA_P_HASH512_ODIGEST_I" offset="4640" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_I" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [255:224] for SHA-384 and SHA-512 / SHA512_HMAC Key [287:256] for HMAC key procR: Outer Digest [255:224] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_J" acronym="HSM_SHA_P_HASH512_ODIGEST_J" offset="4644" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_J" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [223:192] for SHA-384 and SHA-512 / SHA512_HMAC Key [319:288] for HMAC key procR: Outer Digest [223:129] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_K" acronym="HSM_SHA_P_HASH512_ODIGEST_K" offset="4648" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_K" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [191:160] for SHA-384 and SHA-512 / SHA512_HMAC Key [351:320] for HMAC key procR: Outer Digest [191:160] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_L" acronym="HSM_SHA_P_HASH512_ODIGEST_L" offset="4652" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_L" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [159:128] for SHA-384 and SHA-512 / SHA512_HMAC Key [383:352] for HMAC key procR: Outer Digest [159:128] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_M" acronym="HSM_SHA_P_HASH512_ODIGEST_M" offset="4656" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_M" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [128:96] for SHA-384 and SHA-512 / SHA512_HMAC Key [415:384] for HMAC key procR: Outer Digest [128:96] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_N" acronym="HSM_SHA_P_HASH512_ODIGEST_N" offset="4660" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_N" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [95:64] for SHA-384 and SHA-512 / SHA512_HMAC Key [447:416] for HMAC key procR: Outer Digest [95:64] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_O" acronym="HSM_SHA_P_HASH512_ODIGEST_O" offset="4664" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_O" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [63:32] for SHA-384 and SHA-512 / SHA512_HMAC Key [479:448] for HMAC key procR: Outer Digest [63:32] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_ODIGEST_P" acronym="HSM_SHA_P_HASH512_ODIGEST_P" offset="4668" width="32" description="Public World Outer SHA-512 Digest .">
		<bitfield id="ODIGEST_P" width="32" begin="31" end="0" resetval="0x0" description="W: Outer Digest [31:0] for SHA-384 and SHA-512 / SHA512_HMAC Key [511:480] for HMAC key procR: Outer Digest [31:0] for SHA-384 and SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_A" acronym="HSM_SHA_P_HASH512_IDIGEST_A" offset="4672" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_A" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [383:352] for SHA-384 and [511:480] for SHA-512 / SHA512_HMAC Key [543:512] for HMAC key procR: Intermediate / Inner Digest Digest [383:352] for SHA-384 and [511:480] for SHA-512Result Digest/MAC Digest [383:352] for SHA-384 and [511:480] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_B" acronym="HSM_SHA_P_HASH512_IDIGEST_B" offset="4676" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_B" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [531:320] for SHA-384 and [479:448] for SHA-512 / SHA512_HMAC Key [543:512] for HMAC key procR: Intermediate / Inner Digest Digest Digest [531:320] for SHA-384 and [479:448] for SHA-512Result Digest/MAC Digest Digest [531:320] for SHA-384 and [479:448] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_C" acronym="HSM_SHA_P_HASH512_IDIGEST_C" offset="4680" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_C" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [319:288] for SHA-384 and [416:447] for SHA-512 / SHA512_HMAC Key [543:512] for HMAC key procR: Intermediate / Inner Digest Digest Digest [319:288] for SHA-384 and [416:447] for SHA-512Result Digest/MAC Digest Digest [319:288] for SHA-384 and [416:447] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_D" acronym="HSM_SHA_P_HASH512_IDIGEST_D" offset="4684" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_D" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [287:256] for SHA-384 and [415:384] for SHA-512 / SHA512_HMAC Key [639:608] for HMAC key procR: Intermediate / Inner Digest [287:256] for SHA-384 and [415:384] for SHA-512Result Digest/MAC Digest Digest [287:256] for SHA-384 and [415:384] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_E" acronym="HSM_SHA_P_HASH512_IDIGEST_E" offset="4688" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_E" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [255:224] for SHA-384 and [383:362] for SHA-512 / SHA512_HMAC Key [671:640] for HMAC key procR: Intermediate / Inner Digest [255:224] for SHA-384 and [383:362] for SHA-512Result Digest/MAC Digest Digest [255:224] for SHA-384 and [383:362] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_F" acronym="HSM_SHA_P_HASH512_IDIGEST_F" offset="4692" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_F" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [223:192] for SHA-384 and [351:320] for SHA-512 / SHA512_HMAC Key [703:672] for HMAC key procR: Intermediate / Inner Digest [223:192] for SHA-384 and [351:320] for SHA-512Result Digest/MAC Digest Digest [223:192] for SHA-384 and [351:320] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_G" acronym="HSM_SHA_P_HASH512_IDIGEST_G" offset="4696" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_G" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [191:160] for SHA-384 and [319:288] for SHA-512 / SHA512_HMAC Key [735:704] for HMAC key procR: Intermediate / Inner Digest [191:160] for SHA-384 and [319:288] for SHA-512Result Digest/MAC Digest Digest [191:160] for SHA-384 and [319:288] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_H" acronym="HSM_SHA_P_HASH512_IDIGEST_H" offset="4700" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_H" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [159:128] for SHA-384 and [287:256] for SHA-512 / SHA512_HMAC Key [767:736] for HMAC key procR: Intermediate / Inner Digest [159:128] for SHA-384 and [287:256] for SHA-512Result Digest/MAC Digest Digest [159:128] for SHA-384 and [287:256] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_I" acronym="HSM_SHA_P_HASH512_IDIGEST_I" offset="4704" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_I" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [127:96] for SHA-384 and [255:224] for SHA-512 / SHA512_HMAC Key [799:768] for HMAC key procR: Intermediate / Inner Digest [127:96] for SHA-384 and [255:224] for SHA-512Result Digest/MAC Digest Digest [127:96] for SHA-384 and [255:224] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_J" acronym="HSM_SHA_P_HASH512_IDIGEST_J" offset="4708" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_J" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [95:64] for SHA-384 and [223:192] for SHA-512 / SHA512_HMAC Key [831:800] for HMAC key procR: Intermediate / Inner Digest [95:64] for SHA-384 and [223:192] for SHA-512Result Digest/MAC Digest Digest [95:64] for SHA-384 and [223:192] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_K" acronym="HSM_SHA_P_HASH512_IDIGEST_K" offset="4712" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_K" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [63:32] for SHA-384 and [191:160] for SHA-512 / SHA512_HMAC Key [863:832] for HMAC key procR: Intermediate / Inner Digest [63:32] for SHA-384 and [191:160] for SHA-512Result Digest/MAC Digest Digest [63:32] for SHA-384 and [191:160] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_L" acronym="HSM_SHA_P_HASH512_IDIGEST_L" offset="4716" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_L" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [31:0] for SHA-384 and [159:128] for SHA-512 / SHA512_HMAC Key [895:864] for HMAC key procR: Intermediate / Inner Digest [31:0] for SHA-384 and [159:128] for SHA-512Result Digest/MAC Digest Digest [31:0] for SHA-384 and [159:128] for SHA-512 " range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_M" acronym="HSM_SHA_P_HASH512_IDIGEST_M" offset="4720" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_M" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [127:96] for SHA-512 / SHA512_HMAC Key [927:896] for HMAC key procR: Intermediate / Inner Digest [127:96] for SHA-512Result Digest/MAC Digest Digest [127:96] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_N" acronym="HSM_SHA_P_HASH512_IDIGEST_N" offset="4724" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_N" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [95:64] for SHA-512 / SHA512_HMAC Key [959:928] for HMAC key procR: Intermediate / Inner Digest [95:64] for SHA-512Result Digest/MAC Digest Digest [95:64] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_O" acronym="HSM_SHA_P_HASH512_IDIGEST_O" offset="4728" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_O" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [63:32] for SHA-512 / SHA512_HMAC Key [991:960] for HMAC key procR: Intermediate / Inner Digest [63:32] for SHA-512Result Digest/MAC Digest Digest [63:32] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_IDIGEST_P" acronym="HSM_SHA_P_HASH512_IDIGEST_P" offset="4732" width="32" description="Public World Inner SHA-512 Digest .">
		<bitfield id="IDIGEST_P" width="32" begin="31" end="0" resetval="0x0" description="W: Inner / Initial Digest [31:0] for SHA-512 / SHA512_HMAC Key 1023992] for HMAC key procR: Intermediate / Inner Digest [31:0] for SHA-512Result Digest/MAC Digest Digest [31:0] for SHA-512" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_DIGEST_COUNT" acronym="HSM_SHA_P_HASH512_DIGEST_COUNT" offset="4736" width="32" description="Public World SHA-512 Digest Count .">
		<bitfield id="DIGEST_COUNT" width="32" begin="31" end="0" resetval="0x0" description="W: Initial Digest Count [[31:7] only, [6:0] assumed 0]R: Result / IntermediateDigest Count" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_MODE" acronym="HSM_SHA_P_HASH512_MODE" offset="4740" width="32" description="Public World SHA-512 Hash Mode.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="These bits should be written with zeroes and ignored on reads." range="31:8" rwaccess="R"/>
	<bitfield id="HMAC_OUTER_HASH" width="1" begin="7" end="7" resetval="0x0" description="If set to 1, the HMAC Outer Hash is performed on the hash digest when the inner hash hash finished [block length exhausted and final hash performed if Close Hash is 1].This bit should normally be set together with Close Hash to finish the inner hash first, or Block Length should be zero [HMAC continue with the just outer hash to be done].Auto cleared internally when outer hash performed." range="7" rwaccess="R/W"/>
	<bitfield id="REUSE_HMAC_KEY" width="1" begin="6" end="6" resetval="0x0" description="If set to 1, an HMAC operation is started using the HMAC key that was loaded at the time HMAC Key Processing was last performed, provided that the P_HASH512_ODIGEST registers have not been overwritten since. This makes it possible to authenticate multiple blocks using the HMAC key without actually having to reload the key.Note that P_HASH512_DIGEST_COUNT is forced to 128 to indicate that the 128 byte key XOR ipad block has been processed first. This bit should not be set together with bit 5. " range="6" rwaccess="R/W"/>
	<bitfield id="HMAC_KEY_PROCESSING" width="1" begin="5" end="5" resetval="0x0" description="If set to 1, the hash core will perform HMAC key processing on the HMAC key [with block size length] loaded into the P_HASH512_IDIGEST:P_HASH512_ODIGEST register block. Once HMAC key processing is finished, this bit is automatically cleared and the resulting Inner and Outer digest is available from P_HASH512_IDIGEST and P_HASH512_ODIGEST respectively, after which regular hash processing [using P_HASH512_IDIGEST as initial digest] will commence until the Block Length is exhausted. Note that P_HASH_DIGEST512_COUNT is forced to 128 to indicate that the 128 byte key XOR ipad block has been processed first." range="5" rwaccess="R/W"/>
	<bitfield id="CLOSE_HASH" width="1" begin="4" end="4" resetval="0x0" description="If set to 1, then the hash/HMAC will be 'closed' at the end of the block, as per MD5/SHA-1/SHA-2 specification [i.e. appropriate padding is added].  If set to 0, then the hash/HMAC will not be closed and can be continued later. However, if the hash/HMAC is not closed then the Block Length MUST be a multiple of the hash bloc k size to ensure correct operation. Auto cleared internally when hash close operation starts." range="4" rwaccess="R/W"/>
	<bitfield id="USE_ALG_CONSTANTS" width="1" begin="3" end="3" resetval="0x0" description="If set to 1, the initial digest register will be overwritten with the algorithm constants for the selected algorithm when hashing and the initial digest count register will be reset to 0. This will start a normal hash operation. When continuing an existing hash or when performing an HMAC operation, this register must be set to 0 and the intermediate/inner digest or HMAC key and digest count need to be written to the context input registers prior to Writing P_HASH512_MODE.Auto cleared internally after first block processed." range="3" rwaccess="R/W"/>
	<bitfield id="ALGORITHM" width="3" begin="2" end="0" resetval="0x0" description="These bits select the hash algorithm to be used for processing:000 - MD5010 - SHA-1100 - SHA-224110 - SHA-256001 - SHA-384011 - SHA-512" range="2:0" rwaccess="R/W"/>
	</register><register id="HSM_SHA_P_HASH512_LENGTH" acronym="HSM_SHA_P_HASH512_LENGTH" offset="4744" width="32" description="Public World SHA-512 Block Length .">
		<bitfield id="LENGTH" width="32" begin="31" end="0" resetval="0x0" description="W: Block Length / Remaining Byte Count [bytes]R: Remaining Byte Count" range="31:0" rwaccess="R/W"/>
	</register>
</module>